psp.wsdl

<?xml version="1.0"?>
<wsdl:definitions 
        xmlns="http://schemas.xmlsoap.org/wsdl/" 
        xmlns:dot="http://schemas.datacontract.org/2004/07/Dot.Psp.Common"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:tem="http://tempuri.org/"
        xmlns:ns1="http://tempuri.org/"
        xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
        xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
        xmlns:soap-env="http://schemas.xmlsoap.org/wsdl/soap/" 
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
        xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
        xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" 
        xmlns:tns="http://tempuri.org/" 
        xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" 
        xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" 
        xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" 
        xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" 
        xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" 
        xmlns:wsa10="http://www.w3.org/2005/08/addressing" 
        xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" 
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" 
        name="ServiceWeb" 
        targetNamespace="http://tempuri.org/">
    <wsdl:types> <!--описание типов данных (XSD схема)-->
        <xsd:schema xmlns="http://schemas.xmlsoap.org/wsdl/" 
        xmlns:dot="http://schemas.datacontract.org/2004/07/Dot.Psp.Common"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:tem="http://tempuri.org/"
        xmlns:ns1="http://tempuri.org/"
        xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
        targetNamespace="http://tempuri.org/Imports">
            <xsd:import schemaLocation="https://psp-stage.cdc.nicusa.com/Dot.Psp.Web.ServiceWeb/ServiceWeb.xsd" namespace="http://tempuri.org/"/>
            <xsd:import schemaLocation="https://psp-stage.cdc.nicusa.com/Dot.Psp.Web.ServiceWeb/ServiceWeb0.xsd" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/>
            <xsd:import schemaLocation="https://psp-stage.cdc.nicusa.com/Dot.Psp.Web.ServiceWeb/ServiceWeb1.xsd" namespace="http://schemas.datacontract.org/2004/07/Dot.Psp.Common"/>
        </xsd:schema>
    </wsdl:types>
    <!--дальше <message> - входные/выходные параметры сервиса -->
    <wsdl:message name="IServiceWeb_GetDriverData_InputMessage">
        <wsdl:part name="parameters" element="tns:GetDriverData"/>
    </wsdl:message>
    <wsdl:message name="IServiceWeb_GetDriverData_OutputMessage">
        <wsdl:part name="parameters" element="tns:GetDriverDataResponse"/>
    </wsdl:message>
    
    <wsdl:portType name="IServiceWeb">
        <wsdl:operation name="GetDriverData">
            <wsdl:input wsaw:Action="http://tempuri.org/IServiceWeb/GetDriverData" message="tns:IServiceWeb_GetDriverData_InputMessage"/>
            <wsdl:output wsaw:Action="http://tempuri.org/IServiceWeb/GetDriverDataResponse" message="tns:IServiceWeb_GetDriverData_OutputMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="ServiceWeb" type="tns:IServiceWeb">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="GetDriverData">
            <soap:operation soapAction="http://tempuri.org/IServiceWeb/GetDriverData" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="ServiceWeb">
        <wsdl:port name="ServiceWeb" binding="tns:ServiceWeb">
            <soap:address location="https://psp-stage.cdc.nicusa.com/Dot.Psp.Web.ServiceWeb/ServiceWeb.svc"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
