soap_ex.xml

<soapenv:Envelope xmlns:dot="http://schemas.datacontract.org/2004/07/Dot.Psp.Common"
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:tem="http://tempuri.org/">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
        <wsse:UsernameToken wsu:Id="UsernameToken-4" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:Username>nscwss</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Y@D4hF&Y9pQ)</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">cur2TD5NrfjhegS6DFQnnA==</wsse:Nonce>
        <wsu:Created>2011-01-11T21:32:14.692Z</wsu:Created>
        </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <tem:GetDriverData>
        <tem:request>
        <dot:DOTNumber>0</dot:DOTNumber>
        <dot:UserName>nscwss</dot:UserName>
        <dot:Password>Y@D4hF&Y9pQ)</dot:Password>
        <dot:UserIPAddress/>
        <dot:DriverFirstName>Gary</dot:DriverFirstName>
        <dot:DriverLastName>Testone</dot:DriverLastName>
        <dot:DriverDOB>07/07/1974</dot:DriverDOB>
        <dot:MotorCarrierId>10643</dot:MotorCarrierId>
        <dot:InternalRefId>Internal Reference</dot:InternalRefId>
        <dot:DriverConsent>true</dot:DriverConsent>
        <dot:AuthCode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        <dot:DriverQueries>
        <dot:DriverQuery>
        <dot:DlNum>123456</dot:DlNum>
        <dot:DlLastName>Testone</dot:DlLastName>
        <dot:DlState>GA</dot:DlState>
        </dot:DriverQuery>
        </dot:DriverQueries>
        </tem:request>
        </tem:GetDriverData>
    </soapenv:Body>
</soapenv:Envelope>
